cask_args appdir: '/Applications'

tap "argoproj/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# brew
brew "zsh"
brew "zsh-syntax-highlighting"
brew "readline"
brew "nodenv"
brew "goenv"
brew "imagemagick", link: false
brew "imagemagick@6", link: true
brew "kubernetes-cli", link: false
brew "mysql"
brew "nodebrew"
brew "openssl"
brew "postgresql"
brew "pyenv"
brew "rbenv"
brew "redis@3.2"
brew "watch"
brew "zsh"
brew "argoproj/tap/argo"
brew "hub"
brew "sshpass"
brew "tree"
brew "mecab"
brew "golangci-lint"

# cask
cask "r"
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'sequel-pro'
cask 'visual-studio-code'
cask 'notion'
cask 'karabiner-elements'
cask 'github'
cask 'slack'
cask 'alfred'

